INTRO_PROMPT = """
<b>Привет! Рад тебя видеть в учебном модуле по фреймворку DFF — это мощный инструмент для создания чат-ботов и виртуальных ассистентов.</b>

Он поможет тебе легко организовать диалоги, работать с NLP и адаптировать систему под свои нужды.

Что ты можешь сделать здесь:
• <b>Начни обучение</b> — напиши мне, какую главу хочешь изучить, и мы начнем.
• <b>Тесты и прогресс</b> — проверь свои знания и отследи свой прогресс в учебе в нижней панели. Тест вы можете пройти тогда, когда полностью прошли главу.
• <b>Задавай вопросы по фреймворку</b> — интересуешься чем-то конкретным? Спрашивай, я здесь, чтобы помочь!
• <b>Связь с ментором</b> — если тебе нужна дополнительная поддержка, напиши, и я подключу тебя к ментору.

<b>Давай учиться и развиваться вместе!</b>

Расскажи, как тебя зовут?
"""






